templates/media-content/version-1-1-0/get-media-date-modified.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Body>
        <GetMediaDateModifiedRequest xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/">
            <wsVersion xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/SharedObjects/">
                {{wsVersion}}
            </wsVersion>
            <id xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/SharedObjects/">
                {{username}}
            </id>
            <password xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/SharedObjects/">
                {{password}}
            </password>
            <cultureName xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/SharedObjects/">
                {{cultureName}}
            </cultureName>
            <changeTimeStamp xmlns="http://www.promostandards.org/WSDL/MediaService/1.0.0/SharedObjects/">
                {{changeTimeStamp}}
            </changeTimeStamp>
        </GetMediaDateModifiedRequest>
    </soap-env:Body>
</soap-env:Envelope>